IDEA StatiCa Open Model
MatConcreteSIA.CalculateDependentValues Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 setting calculation dependent values on fck
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool CalculateDependentValues { get; set; }
Public Property CalculateDependentValues As Boolean
	Get
	Set
public:
property bool CalculateDependentValues {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
MatConcreteSIA Class
IdeaRS.OpenModel.Material Namespace